{
    "Authentication information": "Por favor, presione el botón anterior para autenticar con su cuenta Netatmo para permitir el acceso a los datos. Necesitas autenticar de nuevo cada vez que agregas más tipos de dispositivo a tu cuenta, ¡de lo contrario podrías perder datos!",
    "CO": "sensor de monóxido de carbono",
    "CheckIntervall": "Intervalo de actualización de datos",
    "CleanupIntervall": "Intervalo de limpieza de datos",
    "ClientID": "ID de cliente individual",
    "ClientSecret": "Secreto de cliente individual",
    "E-Mail": "Email",
    "Elevation": "Elevación",
    "Health Coach": "entrenador de salud",
    "Login with Netatmo": "Iniciar sesión con Netatmo",
    "Netatmo App": "Desde tu App Netatmo",
    "Password": "Clave",
    "RemoveEvents": "Eliminar eventos anteriores a",
    "RemoveUnknownPerson": "Eliminar personas desconocidas vistas por última vez mayores de",
    "Smokedetector": "detector de humo",
    "Weather station": "Estación meteorológica",
    "Welcome indoor cam": "Welcome Cámara interior/exterior",
    "auth_info_individual_credentials": "Después de ingresar o cambiar una identificación de cliente dedicada, repita el proceso de autenticación usando el botón anterior.",
    "clean minutes": "(minutos)",
    "hours": "(horas)",
    "live_stream1": "Para aumentar el intervalo de actualización o recibir transmisiones en vivo de Welcome & Presencia o para recibir alertas de humo en tiempo real, timbre o el sensor de CO, ¡debe solicitar su propia clave API de Netatmo!",
    "live_stream2": "Para ello, acceda a la siguiente URL, inicie sesión con su cuenta Netatmo y rellene el formulario solicitado",
    "load minutes": "(minutos)",
    "meters": "metros sobre nN",
    "iotInstanceLabel": "Instancia iot para eventos en tiempo real",
    "_realtimeEventInfo": "Para recibir eventos en tiempo real de Bienvenida y presencia o recibir alertas de humo, timbre o sensor de CO en tiempo real, debe seleccionar una instancia de adaptador iot que tenga un asistente activo o una licencia remota para pasar los datos del evento.",
    "_realtimeEventHeader": "Eventos en tiempo real",
    "_additionalSettingsHeader": "Ajustes adicionales"
}
