{
    "Authentication information": "Будь ласка, натисніть кнопку вище, щоб автентифікуватися за допомогою свого облікового запису Netatmo, щоб отримати доступ до даних. Щоразу, коли ви додаєте нові типи пристроїв до свого облікового запису, вам потрібно знову проходити автентифікацію, інакше ви можете втратити дані!",
    "CO": "датчик CO",
    "CheckIntervall": "Інтервал оновлення даних",
    "CleanupIntervall": "Інтервал очищення даних",
    "ClientID": "Індивідуальний ідентифікатор клієнта",
    "ClientSecret": "Індивідуальний секрет клієнта",
    "E-Mail": "Електронна пошта",
    "Elevation": "Висота",
    "Health Coach": "Тренер здоров'я",
    "Login with Netatmo": "Увійдіть за допомогою Netatmo",
    "Netatmo App": "З вашого додатку Netatmo",
    "Password": "Пароль",
    "RemoveEvents": "Видалити події, старші ніж",
    "RemoveUnknownPerson": "Видаліть невідомих людей, яких востаннє бачили старше ніж",
    "Smokedetector": "Детектор диму",
    "Weather station": "Метеостанція",
    "Welcome indoor cam": "Ласкаво просимо внутрішню/зовнішню камеру",
    "_additionalSettingsHeader": "Додаткові налаштування",
    "_realtimeEventHeader": "Події в реальному часі",
    "_realtimeEventInfo": "Щоб отримувати події в режимі реального часу від Welcome & Presence або отримувати сповіщення про дим у реальному часі, дверний дзвінок або датчик CO, вам потрібно вибрати екземпляр iot Adapter, який має активний помічник або віддалену ліцензію для передачі даних про події!",
    "auth_info_individual_credentials": "Після введення або зміни індивідуального ідентифікатора клієнта повторіть процес автентифікації за допомогою кнопки вище.",
    "clean minutes": "(хвилин)",
    "hours": "(годин)",
    "iotInstanceLabel": "Екземпляр iot для подій у реальному часі",
    "live_stream1": "Щоб збільшити інтервал оновлення або отримувати прямі трансляції від Welcome & Presence або отримувати сповіщення про дим у реальному часі, дверний дзвінок чи датчик CO, ви повинні запросити власний ключ API від Netatmo!",
    "live_stream2": "Для цього перейдіть за наведеною нижче URL-адресою, увійдіть у свій обліковий запис Netatmo та заповніть необхідну форму",
    "load minutes": "(хвилин)",
    "meters": "метрів"
}
