{
    "Authentication information": "Пожалуйста, нажмите кнопку выше, чтобы подтвердить подлинность вашей учетной записи Netatmo, чтобы позволить получить доступ к данным. Вам нужно снова аутентифицировать, когда вы добавляете больше типов устройств на свой счет, еще вы можете пропустить данные!",
    "CO": "Датчик угарного газа",
    "CheckIntervall": "Интервал обновления данных",
    "CleanupIntervall": "Интервал очистки данных",
    "ClientID": "Индивидуальный идентификатор клиента",
    "ClientSecret": "Индивидуальный секрет клиента",
    "E-Mail": "Эл. почта",
    "Elevation": "Высота",
    "Health Coach": "Тренер по здоровью",
    "Login with Netatmo": "Войти с Netatmo",
    "Netatmo App": "Из вашего приложения Netatmo",
    "Password": "Пароль",
    "RemoveEvents": "Удалить события старше",
    "RemoveUnknownPerson": "Удалить неизвестных лиц, которых последний раз видели старше",
    "Smokedetector": "детектор дыма",
    "Weather station": "Метеостанция",
    "Welcome indoor cam": "Welcome внутренняя камера",
    "_additionalSettingsHeader": "Дополнительные настройки",
    "_realtimeEventHeader": "События в реальном времени",
    "_realtimeEventInfo": "Чтобы получать события в реальном времени от приложения «Добро пожаловать и присутствие» или получать оповещения о дыме, дверном звонке или датчике угарного газа в реальном времени, вам необходимо выбрать экземпляр IoT-адаптера с активным помощником или удаленной лицензией для передачи данных о событиях!",
    "auth_info_individual_credentials": "После ввода или изменения выделенного идентификатора клиента повторите процесс аутентификации, используя кнопку выше.",
    "clean minutes": "(минут)",
    "hours": "(часы)",
    "iotInstanceLabel": "Инстанс iot для событий в реальном времени",
    "live_stream1": "Чтобы увеличить интервал обновления или получать прямые трансляции от Welcome & Присутствие или для получения оповещений о дыме в реальном времени, дверном звонке или датчике CO, вы должны запросить свой собственный ключ API от Netatmo!",
    "live_stream2": "Для этого перейдите по следующему URL-адресу, войдите в свою учетную запись Netatmo и заполните требуемую форму.",
    "load minutes": "(минут)",
    "meters": "метров свыше нН",
    "netatmoBubendorff": "iDiamant/Бубендорф"
}
